{
  "add_cross_attention": false,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-ALLERGY",
    "2": "I-ALLERGY",
    "3": "B-DIAGNOSIS",
    "4": "I-DIAGNOSIS",
    "5": "B-LAB_RESULT",
    "6": "I-LAB_RESULT",
    "7": "B-MEDICATION",
    "8": "I-MEDICATION",
    "9": "B-RED_FLAG",
    "10": "I-RED_FLAG",
    "11": "B-SYMPTOM",
    "12": "I-SYMPTOM"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-ALLERGY": 1,
    "B-DIAGNOSIS": 3,
    "B-LAB_RESULT": 5,
    "B-MEDICATION": 7,
    "B-RED_FLAG": 9,
    "B-SYMPTOM": 11,
    "I-ALLERGY": 2,
    "I-DIAGNOSIS": 4,
    "I-LAB_RESULT": 6,
    "I-MEDICATION": 8,
    "I-RED_FLAG": 10,
    "I-SYMPTOM": 12,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "tie_word_embeddings": true,
  "transformers_version": "5.5.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
